; domain
; ==========================================================
; DOMAIN: SATELLITE
;
; Il satellite può:
;   - ruotare
;   - fotografare oggetti
;   - inviare immagini
;
; Vincoli modellati:
;   - orientamento
;   - memoria
;   - slot immagini
;   - qualità HD / SD
;
; Compatibile con Fast Downward
;
; ==========================================================

(define (domain satellite)

(:requirements
    :strips
    :typing
    :negative-preconditions
)

; ==========================================================
; TIPI

(:types
    direction
    object
)

; ==========================================================
; PREDICATI


(:constants
    N NE E SE S SW W NW - direction
)

(:predicates

    ; orientamento corrente
    (pointing ?d - direction)

    ; oggetto visibile da una direzione
    (visible ?o - object ?d - direction)

    ; foto salvata in memoria
    (stored ?o - object)

    ; foto inviata alla Terra
    (sent ?o - object)

    ; qualità richiesta
    (hd ?o - object)
    (sd ?o - object)

    ; memoria disponibile
    (memory-free)

    ; slot disponibile
    (slot-free)
)

; ==========================================================
; ROTAZIONE DESTRA


(:action rotate-right

    :parameters (?from - direction ?to - direction)

    :precondition
    (pointing ?from)

    :effect
    (and
        (not (pointing ?from))
        (pointing ?to)
    )
)

; ==========================================================
; ROTAZIONE SINISTRA

(:action rotate-left

    :parameters (?from - direction ?to - direction)

    :precondition
    (pointing ?from)

    :effect
    (and
        (not (pointing ?from))
        (pointing ?to)
    )
)

; ==========================================================
; FOTO HD

(:action take-picture-hd

    :parameters (?o - object ?d - direction)

    :precondition
    (and
        (pointing ?d)
        (visible ?o ?d)

        (hd ?o)

        (not (stored ?o))
        (not (sent ?o))

        (memory-free)
        (slot-free)
    )

    :effect
    (and
        (stored ?o)

        (not (memory-free))
        (not (slot-free))
    )
)

; ==========================================================
; FOTO SD

(:action take-picture-sd

    :parameters (?o - object ?d - direction)

    :precondition
    (and
        (pointing ?d)
        (visible ?o ?d)

        (sd ?o)

        (not (stored ?o))
        (not (sent ?o))

        (memory-free)
        (slot-free)
    )

    :effect
    (and
        (stored ?o)

        (not (memory-free))
        (not (slot-free))
    )
)

; ==========================================================
; INVIO HD

(:action send-hd

    :parameters (?o - object ?north - direction)

    :precondition
    (and
        (pointing ?north)

        (stored ?o)
        (hd ?o)
    )

    :effect
    (and
        (not (stored ?o))
        (sent ?o)

        (memory-free)
        (slot-free)
    )
)

; ==========================================================
; INVIO SD

(:action send-sd

    :parameters (?o - object ?north - direction)

    :precondition
    (and
        (pointing ?north)

        (stored ?o)
        (sd ?o)
    )

    :effect
    (and
        (not (stored ?o))
        (sent ?o)

        (memory-free)
        (slot-free)
    )
)

)

; problem
; ==========================================================
; PROBLEM EASY
; ==========================================================

(define (problem satellite-easy)

(:domain satellite)

; ==========================================================
; OGGETTI

(:objects

    N E S W NE NW SE SW - direction

    star1 noise1 - object
)

; ==========================================================
; STATO INIZIALE

(:init

    ; orientamento iniziale
    (pointing N)

    ; memoria disponibile
    (memory-free)

    ; slot disponibile
    (slot-free)

    ; visibilità
    (visible star1 E)
    (visible noise1 E)

    ; qualità richiesta
    (hd star1)
)

; ==========================================================
; GOAL

(:goal
    (and
        (sent star1)
    )
)

)

; plan
1. (rotate-right n ne)
   deleted: (pointing n)
   added: (pointing ne)
   goals met: 0 of 1
2. (rotate-right ne e)
   deleted: (pointing ne)
   added: (pointing e)
   goals met: 0 of 1
3. (take-picture-hd star1 e)
   deleted: (memory-free) (slot-free)
   added: (stored star1)
   goals met: 0 of 1
4. (rotate-left e ne)
   deleted: (pointing e)
   added: (pointing ne)
   goals met: 0 of 1
5. (rotate-left ne n)
   deleted: (pointing ne)
   added: (pointing n)
   goals met: 0 of 1
6. (send-hd star1 n)
   deleted: (stored star1)
   added: (sent star1) (memory-free) (slot-free)
   goals met: 1 of 1
